!function(){}();//!
jQuery.noConflict();
jQuery(document).ready(function(jQuery){
	"use strict";
	var tagidObj={
		"进干流量1":"text5491",
		"进干流量2":"text5491-0",
		"进干流量3":"text5491-8",
		"进干流量4":"text5491-01",
		"温度1-1":"text5491-4",
		"温度1-2":"text5491-4-2",
		"温度2-1":"text5491-9",
		"温度2-2":"text5491-9-1",
		"温度3-1":"text5491-6",
		"温度3-2":"text5491-6-2",
		"温度4-1":"text5491-5",
		"温度4-2":"text5491-5-1",
		"1#进湿阀":"text5491-4-2-0",
		"2#进湿阀":"text5491-9-1-9",
		"3#进湿阀":"text5491-6-2-0",
		"4#进湿阀":"text5491-5-1-4",
		"罐体压力":"text5491-5-3",
		"供气流量":"text5491-5-8",
		"供气压力":"text5491-5-7",
		"储气压力":"text5491-5-71",
	};
	var tagvalueObj={
		"进干流量1":"841.62t/h",
		"进干流量2":"841.62t/h",
		"进干流量3":"841.62t/h",
		"进干流量4":"841.62t/h",
		"温度1-1":"102.76℃",
		"温度1-2":"102.76℃",
		"温度2-1":"102.76℃",
		"温度2-2":"102.76℃",
		"温度3-1":"102.76℃",
		"温度3-2":"102.76℃",
		"温度4-1":"102.76℃",
		"温度4-2":"102.76℃",
		"1#进湿阀":"841.62t/h",
		"2#进湿阀":"841.62t/h",
		"3#进湿阀":"841.62t/h",
		"4#进湿阀":"841.62t/h",
		"罐体压力":"0.69Mpa",
		"供气流量":"841.62t/h",
		"供气压力":"0.53Mpa",
		"储气压力":"0.47Mpa",
	};
	init();
	function init(){
		showRealtimeValue();
	}
	function showRealtimeValue(){
		for(var i in tagidObj){
			Snap("#"+tagidObj[i]).node.textContent=tagvalueObj[i];
		}
	}
});

